# 4.Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# *Пример:*
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10
x = int(input('Введите число: '))
num = []

while x != 0:
    if x % 2 != 0:
        a = x % 2   
        x = x//2    
        num.append(a)
    else:
        b = 0
        num.append(b)
        x = x//2
    num.reverse()

print(*num, sep="")
